zzzz1121/A-dream/src/m5stack_core_esp32_test/main.cpp
bool readPressureSensorRaw() {
#if PRESSURE_SENSOR_PIN >= 0
  return digitalRead(PRESSURE_SENSOR_PIN) == PRESSURE_SENSOR_ACTIVE_LEVEL;
#else
  return false;
#endif
}

void initPressureSensor() {
#if PRESSURE_SENSOR_PIN >= 0
  pinMode(PRESSURE_SENSOR_PIN, INPUT);
  pressureLastRawPressed = readPressureSensorRaw();
  pressureStablePressed = pressureLastRawPressed;
  pressurePressed = pressureStablePressed;
  Serial.print("EVENT=PRESSURE_SENSOR_READY PIN=");
  Serial.print(PRESSURE_SENSOR_PIN);
  Serial.print(" ACTIVE_LEVEL=");
  Serial.println(PRESSURE_SENSOR_ACTIVE_LEVEL == HIGH ? "HIGH" : "LOW");
#else
  pressurePressed = false;
  pressureStablePressed = false;
  pressureLastRawPressed = false;
  Serial.println("EVENT=PRESSURE_SENSOR_READY PIN=UNCONFIGURED");
#endif
  pressureLastChangeMs = millis();
}

void handlePressureSensor() {
  const uint32_t now = millis();
  const bool rawPressed = readPressureSensorRaw();
  if (rawPressed != pressureLastRawPressed) {
    pressureLastRawPressed = rawPressed;
    pressureLastChangeMs = now;
  }

  if (now - pressureLastChangeMs < PRESSURE_SENSOR_DEBOUNCE_MS) {
    pressurePressed = pressureStablePressed;
    return;
  }

  if (rawPressed == pressureStablePressed) {
    pressurePressed = pressureStablePressed;
    return;
  }

  pressureStablePressed = rawPressed;
  pressurePressed = pressureStablePressed;
  if (!pressureStablePressed) {
    return;
  }

  const uint32_t micAgeMs = haveMicStatus ? now - lastMicStatusMs : 0xFFFFFFFFUL;
  const bool bubbleBusy = haveMicStatus &&
                          micAgeMs < MIC_STATUS_TIMEOUT_MS &&
                          latestMicStatus.bubbleState != BUBBLE_IDLE;
  if (bubbleBusy) {
    Serial.println("EVENT=PRESSURE_TRIGGER_IGNORED REASON=BUBBLE_BUSY");
    return;
  }

  pressureTriggerCount++;
  pressureLastTriggerMs = now;
  sendLocalControl(CONTROL_BUBBLE_TRIGGER);
  Serial.println("EVENT=PRESSURE_TRIGGER ACTION=BUBBLE_TRIGGER");
}

void handleButtons() {
  if (M5.BtnA.wasPressed()) {
    sendLocalControl(CONTROL_SYSTEM_ENABLE);
    Serial.println("EVENT=LOCAL_CONTROL ACTION=SYSTEM_ENABLE SOURCE=BTN_A");
  }
  if (M5.BtnC.wasPressed()) {
    sendLocalControl(CONTROL_SYSTEM_DISABLE);
    Serial.println("EVENT=LOCAL_CONTROL ACTION=SYSTEM_DISABLE SOURCE=BTN_C");
  }
  if (M5.BtnB.wasPressed()) {
    sendLocalControl(CONTROL_ALL_STOP);
    Serial.println("EVENT=LOCAL_CONTROL ACTION=ALL_STOP SOURCE=BTN_B");
  }
}

void processSerialLine() {
  serialLine[serialLineIndex] = '\0';
  if (serialLineIndex == 0) {
    return;
  }

  DreamEegEspNowPacket packet = {};
  if (parseEegLine(serialLine, packet)) {
    latestEegPacket = packet;
    serialFrameCount++;
    lastSerialFrameMs = millis();
    haveEeg = true;

    Serial.print("EVENT=SERIAL_EEG_RX SEQ=");
    Serial.print(latestEegPacket.seq);
    Serial.print(" ATTENTION=");
    Serial.print(latestEegPacket.attention);
    Serial.print(" MEDITATION=");
    Serial.print(latestEegPacket.meditation);
    Serial.print(" POOR_SIGNAL=");
    Serial.println(latestEegPacket.poorSignal);

    sendEegToMicroduino();
    return;
  }

  DreamControlEspNowPacket controlPacket = {};
  if (parseControlLine(serialLine, controlPacket)) {
    controlRxCount++;
    Serial.print("EVENT=SERIAL_CMD_RX SEQ=");
    Serial.print(controlPacket.seq);
    Serial.print(" ACTION=");
    Serial.println(controlPacket.action);
    sendControlToMicroduino(controlPacket);
    return;
  }

  serialErrorCount++;
  Serial.print("EVENT=SERIAL_PARSE_FAIL TEXT=");
  Serial.println(serialLine);
}

void handleSerialInput() {
  while (Serial.available() > 0) {
    const char value = static_cast<char>(Serial.read());
    if (value == '\r') {
      continue;
    }

    if (value == '\n') {
      processSerialLine();
      serialLineIndex = 0;
      continue;
    }

    if (value < 0x20 || value > 0x7E) {
      continue;
    }

    if (serialLineIndex < SERIAL_LINE_BUFFER_SIZE - 1) {
      serialLine[serialLineIndex++] = value;
    } else {
      serialLineIndex = 0;
      serialErrorCount++;
      Serial.println("EVENT=SERIAL_LINE_TOO_LONG");
    }
  }
}

void onEspNowSent(const uint8_t *macAddress, esp_now_send_status_t status) {
  lastSendStatus = status;
  if (status != ESP_NOW_SEND_SUCCESS) {
    espNowSendFailCount++;
  }
}

void handleEspNowReceive(const uint8_t *macAddress, const uint8_t *data, int dataLength) {
  if (dataLength != static_cast<int>(sizeof(DreamMicStatusPacket))) {
    return;
  }

  DreamMicStatusPacket packet = {};
  memcpy(&packet, data, sizeof(packet));
  if (packet.magic != DREAM_PACKET_MAGIC ||
      packet.version != DREAM_PROTOCOL_VERSION ||
      packet.type != DREAM_PACKET_MIC_STATUS) {
    return;
  }

  const uint16_t expectedChecksum = calculatePacketChecksum(packet);
  if (packet.checksum != expectedChecksum) {
    return;
  }

  latestMicStatus = packet;
  haveMicStatus = true;
  lastMicStatusMs = millis();
}

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void onEspNowReceive(const esp_now_recv_info_t *recvInfo, const uint8_t *data, int dataLength) {
  const uint8_t *macAddress = recvInfo == nullptr ? nullptr : recvInfo->src_addr;
  handleEspNowReceive(macAddress, data, dataLength);
}
#else
void onEspNowReceive(const uint8_t *macAddress, const uint8_t *data, int dataLength) {
  handleEspNowReceive(macAddress, data, dataLength);
}
#endif

void initEspNow() {
  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  esp_wifi_set_ps(WIFI_PS_NONE);
  esp_wifi_set_channel(ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);

  Serial.print("EVENT=WIFI_STA_READY MAC=");
  Serial.println(WiFi.macAddress());
  Serial.print("EVENT=ESPNOW_CHANNEL VALUE=");
  Serial.println(ESPNOW_CHANNEL);

  const esp_err_t initResult = esp_now_init();
  if (initResult != ESP_OK) {
    Serial.print("EVENT=ESPNOW_INIT_FAIL ERR=");
    Serial.println(initResult);
    espNowReady = false;
    return;
  }

  esp_now_register_send_cb(onEspNowSent);
  esp_now_register_recv_cb(onEspNowReceive);

  esp_now_peer_info_t peerInfo = {};
  memcpy(peerInfo.peer_addr, BROADCAST_MAC, sizeof(BROADCAST_MAC));
  peerInfo.channel = ESPNOW_CHANNEL;
  peerInfo.ifidx = WIFI_IF_STA;
  peerInfo.encrypt = false;

  const esp_err_t peerResult = esp_now_add_peer(&peerInfo);
  if (peerResult != ESP_OK && peerResult != ESP_ERR_ESPNOW_EXIST) {
    Serial.print("EVENT=ESPNOW_ADD_PEER_FAIL ERR=");
    Serial.println(peerResult);
    espNowReady = false;
    return;
  }

  espNowReady = true;
  Serial.println("EVENT=ESPNOW_READY MODE=BROADCAST");
}

