zzzz1121/A-dream/src/m5stack_core_esp32_test/main.cpp
void drawStaticScreen() {
  M5.Lcd.fillScreen(0x0000);
  M5.Lcd.fillRect(0, 0, 320, 28, 0x18E3);
  M5.Lcd.setTextSize(2);
  M5.Lcd.setTextColor(0xFFFF, 0x18E3);
  M5.Lcd.setCursor(8, 6);
  M5.Lcd.print("Dream M5 Gateway");
}

template <typename Canvas>
void drawDashboardContent(Canvas &canvas, int16_t yShift) {
  const uint32_t now = millis();
  const uint32_t serialAgeMs = haveEeg ? now - lastSerialFrameMs : 0xFFFFFFFFUL;
  const uint32_t micAgeMs = haveMicStatus ? now - lastMicStatusMs : 0xFFFFFFFFUL;
  const bool micStatusFresh = haveMicStatus && micAgeMs < MIC_STATUS_TIMEOUT_MS;
  const uint8_t displayedPoorSignal = haveEeg ? latestEegPacket.poorSignal : 255;
  const uint32_t alphaPower = latestEegPacket.eegPower[2] + latestEegPacket.eegPower[3];
  const uint32_t betaPower = latestEegPacket.eegPower[4] + latestEegPacket.eegPower[5];
  const uint32_t gammaPower = latestEegPacket.eegPower[6] + latestEegPacket.eegPower[7];

  canvas.setTextSize(1);

  canvas.fillRect(0, 34 + yShift, 320, 14, 0x0000);
  canvas.setTextColor(ageColor(serialAgeMs, 500, SERIAL_TIMEOUT_MS), 0x0000);
  canvas.setCursor(8, 36 + yShift);
  canvas.printf("USB:%s age:%lums frames:%lu err:%lu",
                haveEeg && serialAgeMs < SERIAL_TIMEOUT_MS ? "OK" : "WAIT",
                haveEeg ? static_cast<unsigned long>(serialAgeMs) : 0,
                static_cast<unsigned long>(serialFrameCount),
                static_cast<unsigned long>(serialErrorCount));

  canvas.fillRect(0, 50 + yShift, 320, 14, 0x0000);
  canvas.setTextColor(lastSendStatus == ESP_NOW_SEND_SUCCESS ? 0x07E0 : 0xFFE0, 0x0000);
  canvas.setCursor(8, 52 + yShift);
  canvas.printf("ESP:%s tx:%lu fail:%lu ch:%u",
                espNowReady ? (lastSendStatus == ESP_NOW_SEND_SUCCESS ? "OK" : "SEND") : "OFF",
                static_cast<unsigned long>(espNowSendCount),
                static_cast<unsigned long>(espNowSendFailCount),
                ESPNOW_CHANNEL);

  canvas.fillRect(0, 72 + yShift, 320, 24, 0x0000);
  canvas.setTextColor(signalColor(displayedPoorSignal), 0x0000);
  canvas.setTextSize(2);
  canvas.setCursor(8, 76 + yShift);
  canvas.printf("Signal:%3u", displayedPoorSignal);

  canvas.fillRect(0, 100 + yShift, 320, 24, 0x0000);
  canvas.setTextColor(0xFFFF, 0x0000);
  canvas.setCursor(8, 104 + yShift);
  canvas.printf("Att:%3u  Med:%3u",
                haveEeg ? latestEegPacket.attention : 0,
                haveEeg ? latestEegPacket.meditation : 0);

  canvas.setTextSize(1);
  canvas.fillRect(0, 134 + yShift, 320, 14, 0x0000);
  canvas.setCursor(8, 136 + yShift);
  canvas.printf("seq:%lu pc:%lums",
                static_cast<unsigned long>(latestEegPacket.seq),
                static_cast<unsigned long>(latestEegPacket.pcTimeMs));
  canvas.fillRect(0, 150 + yShift, 320, 14, 0x0000);
  canvas.setCursor(8, 152 + yShift);
  canvas.printf("delta:%lu theta:%lu alpha:%lu",
                static_cast<unsigned long>(latestEegPacket.eegPower[0]),
                static_cast<unsigned long>(latestEegPacket.eegPower[1]),
                static_cast<unsigned long>(alphaPower));
  canvas.fillRect(0, 166 + yShift, 320, 14, 0x0000);
  canvas.setCursor(8, 168 + yShift);
  canvas.printf("beta:%lu gamma:%lu",
                static_cast<unsigned long>(betaPower),
                static_cast<unsigned long>(gammaPower));

  canvas.fillRect(0, 188 + yShift, 320, 14, 0x0000);
  canvas.setTextColor(ageColor(micAgeMs, 1000, MIC_STATUS_TIMEOUT_MS), 0x0000);
  canvas.setCursor(8, 190 + yShift);
  canvas.printf("MIC:%s age:%lums rx:%lu drop:%lu",
                micStatusFresh ? "OK" : "WAIT",
                haveMicStatus ? static_cast<unsigned long>(micAgeMs) : 0,
                static_cast<unsigned long>(latestMicStatus.rxCount),
                static_cast<unsigned long>(latestMicStatus.dropCount));

  canvas.fillRect(0, 204 + yShift, 320, 14, 0x0000);
  canvas.setTextColor(0xFFFF, 0x0000);
  canvas.setCursor(8, 206 + yShift);
  if (micStatusFresh) {
    canvas.printf("Light:%s %u  Step:%s",
                  lightModeName(latestMicStatus.lightMode),
                  latestMicStatus.lightLevel,
                  stepperStateName(latestMicStatus.stepperState));
  } else {
    canvas.print("Light:WAIT 0  Step:WAIT");
  }
  canvas.fillRect(0, 220 + yShift, 320, 14, 0x0000);
  canvas.setCursor(8, 222 + yShift);
  if (micStatusFresh) {
    canvas.printf("Fog:%s Fan:%s Bubble:%s",
                  relayStateName(latestMicStatus.relayState),
                  relayStateName(latestMicStatus.fanState),
                  bubbleStateName(latestMicStatus.bubbleState));
  } else {
    canvas.print("Fog:WAIT Fan:WAIT Bubble:WAIT");
  }

  canvas.fillRect(0, 232 + yShift, 320, 8, 0x0000);
  canvas.setCursor(8, 232 + yShift);
  canvas.setTextColor(pressurePressed ? 0xFFE0 : 0xFFFF, 0x0000);
  const uint32_t pressureAgeMs = pressureLastTriggerMs == 0 ? 0 : now - pressureLastTriggerMs;
  canvas.printf("Press:%s last:%lums", pressurePressed ? "DOWN" : "UP", static_cast<unsigned long>(pressureAgeMs));

  canvas.setCursor(212, 232 + yShift);
  canvas.setTextColor(micStatusFresh && latestMicStatus.systemEnabled ? 0x07E0 : 0xF800, 0x0000);
  canvas.printf("SYS:%s", micStatusFresh && latestMicStatus.systemEnabled ? "ON" : "OFF");
}

void drawDashboard() {
  drawDashboardContent(M5.Lcd, 0);
}

void printStatus() {
  const uint32_t now = millis();
  const uint32_t micAgeMs = haveMicStatus ? now - lastMicStatusMs : 0;
  const bool micStatusFresh = haveMicStatus && micAgeMs < MIC_STATUS_TIMEOUT_MS;
  const uint32_t pressureLastMs = pressureLastTriggerMs == 0 ? 0xFFFFFFFFUL : now - pressureLastTriggerMs;
  Serial.print("EVENT=M5_STATUS SERIAL_FRAMES=");
  Serial.print(serialFrameCount);
  Serial.print(" SERIAL_ERRORS=");
  Serial.print(serialErrorCount);
  Serial.print(" ESPNOW_TX=");
  Serial.print(espNowSendCount);
  Serial.print(" ESPNOW_FAIL=");
  Serial.print(espNowSendFailCount);
  Serial.print(" CMD_RX=");
  Serial.print(controlRxCount);
  Serial.print(" CMD_TX=");
  Serial.print(controlSendCount);
  Serial.print(" CMD_FAIL=");
  Serial.print(controlSendFailCount);
  Serial.print(" MIC_STATUS=");
  Serial.print(micStatusFresh ? "YES" : "NO");
  Serial.print(" SERIAL_AGE_MS=");
  Serial.print(haveEeg ? now - lastSerialFrameMs : 0);
  Serial.print(" MIC_AGE_MS=");
  Serial.print(micAgeMs);
  Serial.print(" EEG_SEQ=");
  Serial.print(haveEeg ? latestEegPacket.seq : 0);
  Serial.print(" POOR_SIGNAL=");
  Serial.print(haveEeg ? latestEegPacket.poorSignal : 255);
  Serial.print(" ATTENTION=");
  Serial.print(haveEeg ? latestEegPacket.attention : 0);
  Serial.print(" MEDITATION=");
  Serial.print(haveEeg ? latestEegPacket.meditation : 0);
  Serial.print(" MIC_RX=");
  Serial.print(latestMicStatus.rxCount);
  Serial.print(" MIC_DROP=");
  Serial.print(latestMicStatus.dropCount);
  Serial.print(" MIC_TIMEOUT=");
  Serial.print(latestMicStatus.timeoutCount);
  Serial.print(" MIC_LIGHT_MODE=");
  Serial.print(latestMicStatus.lightMode);
  Serial.print(" MIC_LIGHT_LEVEL=");
  Serial.print(latestMicStatus.lightLevel);
  Serial.print(" MIC_L1_R=");
  Serial.print(latestMicStatus.light1R);
  Serial.print(" MIC_L1_G=");
  Serial.print(latestMicStatus.light1G);
  Serial.print(" MIC_L1_B=");
  Serial.print(latestMicStatus.light1B);
  Serial.print(" MIC_L1_W=");
  Serial.print(latestMicStatus.light1W);
  Serial.print(" MIC_L2_R=");
  Serial.print(latestMicStatus.light2R);
  Serial.print(" MIC_L2_G=");
  Serial.print(latestMicStatus.light2G);
  Serial.print(" MIC_L2_B=");
  Serial.print(latestMicStatus.light2B);
  Serial.print(" MIC_L2_W=");
  Serial.print(latestMicStatus.light2W);
  Serial.print(" MIC_STEPPER=");
  Serial.print(latestMicStatus.stepperState);
  Serial.print(" MIC_RELAY=");
  Serial.print(latestMicStatus.relayState);
  Serial.print(" MIC_FAN=");
  Serial.print(latestMicStatus.fanState);
  Serial.print(" MIC_BUBBLE=");
  Serial.print(latestMicStatus.bubbleState);
  Serial.print(" MIC_BUBBLE_COUNT=");
  Serial.print(latestMicStatus.bubbleTriggerCount);
  Serial.print(" MIC_BUBBLE_ACTIVE_MS=");
  Serial.print(latestMicStatus.bubbleActiveMs);
  Serial.print(" MIC_SAFETY=");
  Serial.print(latestMicStatus.safetyState);
  Serial.print(" MIC_CONTROL_RX=");
  Serial.print(latestMicStatus.controlRxCount);
  Serial.print(" MIC_LAST_ACTION=");
  Serial.print(latestMicStatus.lastControlAction);
  Serial.print(" MIC_MANUAL_LIGHT=");
  Serial.print(latestMicStatus.manualLightEnabled);
  Serial.print(" MIC_RELAY_ENABLED=");
  Serial.print(latestMicStatus.relayOutputEnabled);
  Serial.print(" MIC_STEPPER_ENABLED=");
  Serial.print(latestMicStatus.stepperOutputEnabled);
  Serial.print(" MIC_BUBBLE_ENABLED=");
  Serial.print(latestMicStatus.bubbleOutputEnabled);
  Serial.print(" MIC_SYSTEM_ENABLED=");
  Serial.print(latestMicStatus.systemEnabled);
  Serial.print(" PRESSURE=");
  Serial.print(pressurePressed ? 1 : 0);
  Serial.print(" PRESSURE_TRIGGER_COUNT=");
  Serial.print(pressureTriggerCount);
  Serial.print(" PRESSURE_LAST_MS=");
  Serial.println(pressureLastMs);
}

void setup() {
  M5.begin();
  M5.Power.begin();
  Serial.begin(SERIAL_BAUD);
  delay(300);

  M5.Lcd.setBrightness(160);
  drawStaticScreen();

  Serial.println();
  Serial.print("EVENT=DREAM_BOOT BOARD=");
  Serial.print(BOARD_NAME);
  Serial.print(" ROLE=");
  Serial.println(DEVICE_ROLE);
  Serial.println("EVENT=SERIAL_READY INPUT=EEG_CSV TARGET=M5STACK");

  initPressureSensor();
  initEspNow();
  drawDashboard();
}

void loop() {
  M5.update();
  handleButtons();
  handlePressureSensor();
  handleSerialInput();

  const uint32_t now = millis();
  if (now - lastDisplayRefreshMs >= DISPLAY_REFRESH_MS) {
    lastDisplayRefreshMs = now;
    drawDashboard();
  }

  if (now - lastStatusPrintMs >= STATUS_PRINT_MS) {
    lastStatusPrintMs = now;
    printStatus();
  }
}
